import numpy as np

sigma_L = 5 * 10 ** (-2)  # m
sigma_x = 1 * 10 ** (-3)  # m

a2 = 25 * 10**(-3)

# сетка 1: (всё в метрах)
a1_1 = 141 * 10**(-3)
b1_a2_1 = 98 * 10**(-2)
b2_1 = 345 * 10**(-3)
x_1 = 0.75 * 10**(-2)
m_1 = 10

# сетка 2: (всё в метрах)
a1_2 = 135 * 10**(-3)
b1_a2_2 = 97.5 * 10**(-2)
b2_2 = 350 * 10**(-3)
x_2 = 0.75 * 10**(-2)
m_2 = 10

# сетка 3: (всё в метрах)
a1_3 = 141 * 10**(-3)
b1_a2_3 = 76 * 10**(-2)
b2_3 = 555 * 10**(-3)
x_3 = 16 * 10**(-3)
m_3 = 5

# сетка 4: (всё в метрах)
a1_4 = 135 * 10**(-3)
b1_a2_4 = 109 * 10**(-2)
b2_4 = 235 * 10**(-3)
x_4 = 1.35 * 10**(-2)
m_4 = 10

# сетка 5: (всё в метрах)
a1_5 = 145 * 10**(-3)
b1_a2_5 = 89 * 10**(-2)
b2_5 = 42 * 10**(-2)
x_5 = 2.3 * 10**(-2)
m_5 = 5

# сетка 6: (всё в метрах)
a1_6 = 145 * 10**(-3)
b1_a2_6 = 80.5 * 10**(-2)
b2_6 = 53 * 10**(-2)
x_6 = 2.25 * 10**(-2)
m_6 = 5

# Увеличение Г(=G)
G = []
sigma_G = []
for i in range(1, 7):
    b1_a2 = locals()[f'b1_a2_{i}']
    b2 = locals()[f'b2_{i}']
    a1 = locals()[f'a1_{i}']
    G.append((b1_a2 - a2) * b2 / (a1 * a2))
    sigma_G.append(((sigma_L / b1_a2)**2 + (2 * 10**(-2) / b2)**2 + (1 * 10**(-3) / a2)**2 + (1 * 10**(-3) / a1)**2)**0.5)

print(G)
G_sred = sum(G) / 6
sigma_G_sred = G_sred * sum(sigma_G)/6
delt_G = []
for i in range(6):
    delt_G.append((G_sred - G[i])**2)
otkl_G = ((1/7) * sum(delt_G))**0.5
print(sigma_G_sred, otkl_G)
error_G = (otkl_G**2 + sigma_G_sred**2)**0.5
print('увеличение Г =', G_sred, '+/-', error_G)

# период решётки
for i in range(1, 7):
    x = locals()[f'x_{i}']
    m = locals()[f'm_{i}']
    d = x / (G_sred * m)
    sigma_d = d * ((sigma_x/x)**2 + (error_G/G[i-1])**2)**0.5
    print(f'период d{i} =', d * 10**6, '+/-', sigma_d * 10**6, 'mkm')