import numpy as np
import matplotlib.pyplot as plt

#измеренные данные:
    #Получение сигнала ЭПР и измерение g - фактора:
f_0 = 140.15 #МГц
        #параметры катушек для определения B0:
D_kat = 14.5 #mm
sigma_D_kat = 0.1 #mm
N = 45 #витков

V_1 = 14.1 #mV
V_2 = 13.0 #mV
w = 2 * 3.14 * 50 #Hz * sec

mu = 0.927 * 10**(-23) #Дж/Тл
h = 1.05 * 10**(-34) #Дж с

    #Определение ширины линии ЭПР:
Vv_1 = 1.6 #mV
Vv_2 = 1.3 #mV


            
V = (V_2 + V_1) / 2 #mV
s_V = V * ((0.1 / V_1)**2 + (0.1 / V_2)**2)**0.5

B_0 = V / (N * w * (3.14 * (D_kat * 10**(-3))**2 / 4)) #mТл
s_B0 = B_0 * ((s_V / V)**2 + (sigma_D_kat / D_kat)**2)**0.5 #mТл
print('B0 =', B_0, '+/-', s_B0, 'мТл')

g = (h * f_0 * 10**(6) * 2 * 3.14) / (mu * B_0 * 10**(-3))
s_g = g * ((0.1 / f_0)**2 + (s_B0 / B_0)**2)**0.5
print('g =', g, '+/-', s_g)


B = ((Vv_1 + Vv_2) / 2) / (N * w * (3.14 * (D_kat * 10**(-3))**2 / 4)) #mТл
s_B = B * ((s_V / V)**2 + (sigma_D_kat / D_kat)**2)**0.5 #mТл
print('B =', B, '+/-', s_B, 'мТл')

A = 6.5
A_05 = 1
s_A = 0.3

DB = A_05 * B / A
s_db = DB * ((s_A / A)**2 + (s_A / A_05)**2 + (s_B / B)**2)**0.5
print('DB =', DB, '+/-', s_db, 'мТл')